//Задача № 9
//Дан массив с элементами 'Привет, ', 'мир' и '!'. Необходимо вывести на экран фразу 'Привет, мир!'


//greeting = [`Привет,`, `мир`, `!`];
//document.write(greeting[0][0][0][1][0][2]);



//Задача № 8
//Создайте переменную str и присвойте ей значение 'abcde'. Обращаясь к отдельным символам этой строки, выведите на экран символ 'a', символ 'b', символ 'e'.




//Задача № 7
// С помощью цикла for сформируйте строку '123456789' и запишите ее в переменную str.

let str = ``;
for(let i = 1; i<=9; i++) {
  str = str + i;
}
console.log(str)







// Задача № 6
// Даны переменные a = 10 и b = 3. Найдите остаток от деления a на b.
//let a = 10; //значение переменной а
//let b = 3; //значение переменной b
//let c; //остаток от деления a на b

//a = +prompt("Введите значение а:");
//b = +prompt("Введите значение b:");

//c = (a/b).toFixed(5);
//alert(`Значение от деления a = ${a} на b = ${b} равен c = ${c}`);